<template>
    <div class="portfolio">
        <div class="screenError">
            <div style="display: flex; flex-direction: column; margin: auto; font-weight: bold">
                <span>Вы из будущего?</span>
                <span>Если нет, то мобильная версия еще в разработке.</span>
                <span>Вы всегда можете оценить наш сайт с Вашего ПК</span>
            </div>
        </div>
        <NavigationBar/>
        <div class="mainPortfolio">
            <section class="container-fluid portfolio-greeting w-100 d-flex  flex-column flex-wrap">
                <h1 class="greeting-header">{{portfolios[$route.params.id - 1].mainAppHeader}}</h1>
                <div class="greeting-content">
                    <img class="greeting-img"
                         :src="portfolios[$route.params.id - 1].mainAppImage"/>
                    <div class="greeting-description">
                        <p>{{portfolios[$route.params.id - 1].mainAppInfo}}</p>
                        <div class="d-inline-flex justify-content-start graphic-editor-list">
                            <img v-for="graphicEditor in portfolios[$route.params.id - 1].graphicEditors"
                                 :key="graphicEditor"
                                 :src="graphicEditor" class="graphic-editor"/>
                        </div>
                    </div>
                </div>
            </section>
            <section class="container-fluid block">
                <div class="block-title">
                    <div class="block-sub-header d-inline-flex">
                        <span>Задача</span>
                        <hr/>
                    </div>
                    <p class="block-header">Что нужно было сделать?</p>
                </div>
                <div class="block-description" id="why-description">
                    <p>{{portfolios[$route.params.id - 1].what}}</p>
                </div>
                <carousel>
                    <slide v-for="app in portfolios[$route.params.id - 1].appPhotos" :key="app"
                           class="d-flex flex-row justify-content-center" style="outline: none !important;">
                        <img class="app-img"
                             :src="app"/>
                    </slide>
                </carousel>
            </section>
            <section class="container-fluid block" style="margin-bottom: 10%">
                <div class="block-title">
                    <div class="block-sub-header d-inline-flex">
                        <span>Решение</span>
                        <hr class="ml-3"/>
                    </div>
                    <p class="block-header">Как мы это делали?</p>
                </div>
                <div class="block-description">
                    <p>{{portfolios[$route.params.id - 1].how}}</p>
                </div>
            </section>
            <section class="container-fluid block" v-if="portfolios[$route.params.id-1].video">
                <div class="block-title">
                    <div class="block-sub-header d-inline-flex">
                        <span>Результат</span>
                        <hr class="ml-3"/>
                    </div>
                    <p class="block-header">Что у нас получилось?</p>
                </div>
                <div class="d-flex justify-content-center">
                    <video controls="controls">
                        <source :src="portfolios[$route.params.id - 1].video"/>
                    </video>
                </div>
            </section>
        </div>
        <Footer/>
    </div>
</template>

<script>
    import NavigationBar from "../components/NavigationBar";
    import Footer from "../components/Footer";
    import {Carousel, Slide} from "vue-carousel";

    class Portfolio {
        constructor(mainAppHeader, mainAppInfo, what, how, mainAppImage, graphicEditors, appsPhotos, video) {
            this.what = what;
            this.how = how;
            this.mainAppHeader = mainAppHeader;
            this.mainAppInfo = mainAppInfo;
            this.mainAppImage = mainAppImage;
            this.graphicEditors = graphicEditors;
            this.appPhotos = appsPhotos;
            this.video = video;
        }
    }

    export default {
        name: "Portfolio.vue",
        components: {Slide, Carousel, Footer, NavigationBar},
        data() {
            return {
                portfolios: [
                    new Portfolio(
                        "Подготовка в медицинским тестам",
                        "Помогает студентам и преподавателям более тщательно подготовиться к медицинским тестам, а также к семинарам. Это призвано помогать студентам с учебой, способствовать более простому и быстрому усвоению материала в такой сложной и важной науке, как медицина. Благодаря этому приложению студент тратит меньше времени на подготовку к тестам, а уровень сдачи тестов остается на том же уровне. Таким образом студент учится эффективнее.",
                        "Реализовать приложение. Необходимо было создать полноценный it продукт, включающий в себя все этапы разработки: начиная от продумывания сложной архитектуры, заканчивая чтением и разбирательством в чужом коде - что является не самой легкой работой. Необходимо было подумать и о будущих пользователях приложения, и проникнуться в азы  медицины",
                        "Во время работы над данным кейсом программист столкнулся с некоторыми затруднениями. Так, например, уже после начала работы над проектом выяснилось, что код, который предоставил изначально заказчик, был написан плохо, его было очень сложно поддерживать. Поэтому программистом было принято решение начать проект с нуля и реализовать его сразу качественно, чтобы в дальнейшем не было проблем с поддержкой. Для этого программист продумал и реализовал по-новой архитектуру всего it приложения. Помимо этого программист нарисовал и воплотил в жизнь новый, более юзабилити дизайн. В итоге получился полноценный продукт, которым и по сей день пользуются люди ",
                        "/img/projects/main7.png",
                        ["/img/projects/skills/java.png", "/img/projects/skills/xml.png"],
                        ["/img/projects/main7.png", "/img/projects/diana/about.jpg", "/img/projects/diana/disciplines.jpg", "/img/projects/diana/accreditationSpo.jpg",
                            "/img/projects/diana/chooseSection.jpg", "/img/projects/diana/menu.jpg", "/img/projects/diana/results.jpg", "/img/projects/diana/untitled.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "LinkBridge",
                        "Создание сайта для передачи ссылки более легким путем тем самым сэкономив вообще драгоценное время .\n" +
                        "\n" +
                        "В данном кейсе программисту необходимо было реализовать не просто IT продукт, а полноценный стартап. Необходимо было провести анализ рынка, подтвердить проблему в обществе. Была проведена полноценная подготовительная работа. Уже после нее был составлен концепт приложения. \n" +
                        "Продукт создавался для определенного круга лиц, именно поэтому получилось сделать максимально удобный и friendly интерфейс.  Идея заключалась в удобной и быстрой передачи ссылки с одного устройства на другой. Основная задача - сделать так, чтобы человек не задумывался о действиях, не тратил драгоценное время\n",
                        "Создание буфера обмена ссылками. \n" +
                        "Необходимо было охватить максимальное количество пользователей, поэтому были реализованы приложения и для платформы ios, и для платформы android. Помимо этого необходимо было реализовать сайт связки и передачи информации между устройствами. \n",
                        "Сделать по сайтам ,как страницы наследники.\n" +
                        "Во время выполнения данного кейса исполнителю пришлось затронуть большое количество областей программирования. Так, необходимо было разрабатывать приложения под 2 различные платформы, написать сайт и реализовать back-end на php. Помимо этого программист принимал активное участие в маркетинге данного продукта. Зато теперь тот круг людей, который нуждался в данном продукте, может быть спокоен, ведь продукт был реализован специально для максимального их удобства. В то же время в продукте не планируется добавление рекламы или других вещей, которые могут отпугнуть пользователя и испортить в целом картину о продукте. Программисту было важно именно изменить мир, а не просто заработать на этом денег.\n",
                        "/img/projects/main4.png",
                        ["/img/projects/skills/java.png", "/img/projects/skills/react.png", "/img/projects/skills/javascript.png"],
                        ["/img/projects/main4.png", "/img/projects/diana/pr3_1.jpg", "/img/projects/diana/pr3_2.jpg", "/img/projects/diana/pr3_3.jpg",
                            "/img/projects/diana/linkBridge2.jpg", "/img/projects/diana/linkBridge3.jpg", "/img/projects/diana/linkBridge4.jpg", "/img/projects/diana/linkBridge5.jpg"],
                        "https://mkc-mkc.github.io/vid/video-placeholder.mp4"
                    ),
                    new Portfolio(
                        "SlidesCatizer",
                        "IT приложение для добавление в презентации картинок из брендбука вашей компании. Приложение было разработано на примерах котиков. Ведь котики захватят весь мир :) В дальнейшем достаточно просто поменять котиков на картинки из Вашего брендбука",
                        "Разработать полноценное IT приложение для добавления определенных картинок (котиков) в Вашу презентацию. Необходимо создать максимально юзер френдли приложение.Разработать полноценное IT приложение для добавления определенных картинок (котиков) в Вашу презентацию. Необходимо создать максимально юзер френдли приложение.",
                        "Мы проработали несколько различных платформ и остановились на веб сайте. Таким образом мы максимально сократили время изменения картинок. Помимо этого вам в принципе нет необходимости взаимодействовать с брендбуком и презентациями, т.к. приложение само добавит картинки.",
                        "/img/projects/main6.png",
                        ["/img/projects/skills/google.png", "/img/projects/skills/python.png", "/img/projects/skills/telegram.png"],
                        ["/img/projects/main6.png"],
                        false
                    ),
                    new Portfolio(
                        "Приложение для завода компании Лукойл",
                        "Приложение направлено на предотвращение экстренных ситуаций на заводе “Метровагонмаш”. Происходит работа с API, где хранятся показатели с датчиков, расположенных на заводских установках. Основная задача - фиксация критических значений и звуковые нативные уведомления на планшетах сотрудников предприятий.",
                        "Требовалось реализовать полноценный сервис, готовый к взаимодействию с установленными датчиками, кроме этого, было необходимо разработать сервисную составляющую проекта, чтобы осуществить максимально быструю передачу данных от датчиков на устройства приема и оповещения",
                        "Первым этапом разработки сервиса стало составление архитектуры, направленной на максимальную скорость и бесперебойность. Вся работа осуществлялась параллельно, то есть каждый блок разрабатывался совместно с предыдущим, данный подход обеспечивал максимальную скорость разработки, что позволило реализовать проект в течение 1 месяца",
                        "/img/projects/main1.png",
                        ["/img/projects/skills/java.png", "/img/projects/skills/spring.png", "/img/projects/skills/xml.png"],
                        ["/img/projects/main1.png", "/img/projects/emil/pr3_1.jpg", "/img/projects/emil/pr3_2.jpg",
                            "/img/projects/emil/pr3_3.jpg", "/img/projects/emil/pr3_4.jpg", "/img/projects/emil/pr3_7.jpg",
                            "/img/projects/emil/pr3_8.jpg", "/img/projects/emil/pr3_9.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "Рекомендательная система для помощи клиентам банка в выборе досуга на выходные",
                        "Алгоритм машинного обучения, направленный на подбор наиболее оптимальных способов проведения досуга в выходные дни. Прогноз осуществляется путем исследования ранних платежей данного пользователя в предыдущие выходные дни.",
                        "Разработать рекомендательную систему для пользователей банка о предстоящих культурных событиях, таких как посещение театра, выставки, кино. На основе обезличенных данных о транзакциях пользователей нужно сделать предсказание того, что понравится конкретному пользователю на следующей неделе.",
                        "При разработке этого приложения использовались вычислительные ресурсы colab-a. Далее весь код переписывался в Файлы.ру. Запуск файлов происходил с помощью скриптов на языке bash. Изначально была произведена аугментация данных с увеличением количества признаков в десятки раз. Затем, эти данные были поданы на вход алгоритмам CatBoost, XGBoost, knn, линейной регрессии и некоторым другим. Самые лучшие результаты были у CatBoost, после чего этот метод тюнился. В конце улучшенную модель еще раз обучили.",
                        "/img/projects/main19.jpg",
                        ["/img/projects/skills/python.png", "/img/projects/skills/catboost.png"],
                        ["/img/projects/main19.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "Приложение для компании Газпром Банк",
                        "Мобильное приложение, направленное на усиление Agile-команд внутри компании Газпромбанк. Усиление обусловлено внедрением различных элементов геймификации: достижения, визуализация задачи в виде определенного противник (нами была выбрана тематика Marvel), поощрение высоких результатов привилегиями на работе, которые были оформлены в виде специальных артефактов (камней бесконечности), внедрение рандома и возможность обмена привилегиями между сотрудниками компании.",
                        "Требовалось разработать мобильное приложение, в котором есть два типа ролей: сотрудник и администратор. Администратор предоставлял задачи и выбирал тематику противников (в нашем случае это были персонажи из комикс Вселенной Marvel), сотрудники же в свою очередь отмечали выполнение определенной задачи в приложении. По завершении спринта, Администратор мог просмотреть результаты команд и выдать легендарные артефакты “Достойным”",
                        "Изначально создавался дизайн в Figma. Далее, после разработки дизайна, были реализованы экраны для телефона, а также back-end для подключения к Android. Это требовалось для работы всех функций. В свою очередь, был проведён анализ бизнес поведения пользователей, что было необходимо для правильного построения логической цепочки.",
                        "/img/projects/main9.png",
                        ["/img/projects/skills/java.png", "/img/projects/skills/xml.png", "/img/projects/skills/firebase.png"],
                        ["/img/projects/main9.png", "/img/projects/emil/pr2_5.jpg", "/img/projects/emil/pr2_3.jpg",
                            "/img/projects/emil/pr2_1.jpg", "/img/projects/emil/pr2_7.jpg", "/img/projects/emil/pr2_6.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "NMC Новая Медицинская Компания",
                        "Сайт для компании, занимающейся дистрибуцией современных высококачественных медицинских изделий для здравоохранения. Данный сайт является интернет-магазином оптОовой торговли с дополнительной узкой направленностью в сторону уточнения и согласования скидок по различным государственным тендерам и программам. Новая Медицинская Компания занимается.",
                        "Требовалось разработать уникальную сайт-визитку, которая содержит каталог товаров, а также полезные статьи для заказчиков и возможных бизнес партнёров. Эти статьи должны отвечать на возникающие вопросы потенциальных клиентов. Важным критерием являлась простота, лёгкость в использовании сайта и лаконичный дизайн.",
                        "В первую очередь, была изучена целевая аудитория. Далее прорабатывались пути потенциального клиента по сайту. После чего, был разработан дизайн, прорабатывалась архитектура back-end и база данных. \n" +
                        "Затем, была написан back-end; верстка производилась по дизайну с использованием JavaScript и Vueпомощью java. Было сделано тестирование, в ходе которого были выявлены проблемы, которые вскоре были исправлены.",
                        "/img/projects/main3.png",
                        ["/img/projects/skills/vue.png", "/img/projects/skills/javascript.png", "/img/projects/skills/python.png", "/img/projects/skills/sass.png"],
                        ["/img/projects/main3.png", "/img/projects/sites/nmc3.jpg", "/img/projects/sites/nmc2.jpg", "/img/projects/sites/nmc.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "TradePlus",
                        "Этот сайт направлен на продажу медицинских изделий, услуг. Основной целевой аудиторией сайта являются медицинские учреждения. Сайт сконцентрирован на улучшении качества медицинского оборудования в Российской Федерации.",
                        "Разработать удобный сайт \n" +
                        "с интуитивно-понятным и приятным глазу дизайном, без лишней информации и «воды». Сайт должен быть прост в использовании, нужные разделы на нем должны быть легко доступны пользователям и подводить его к покупке.\n" +
                        "Помимо этого необходимо было создать не просто IT продукт, но и сделать его продающим.\n",
                        "Для начала, был произведён анализ целевой аудитории компании. Далее, исходя из этих данных, были прописаны пути потенциального клиента по сайту. Затем, дизайнеры разработали лаконичный и удобный визуал, подходящий под требования целевой аудитории. После этого, наш разработчик проработал архитектуру back-end, реализовал ее в проекте и прописал front-end сайта.",
                        "/img/projects/main12.png",
                        ["/img/projects/skills/vue.png", "/img/projects/skills/javascript.png", "/img/projects/skills/sass.png"],
                        ["/img/projects/main12.png", "/img/projects/sites/tradePlus3.jpg",
                            "/img/projects/sites/tradePlus2.jpg", "/img/projects/sites/tradePlus4.jpg", "/img/projects/sites/tradePlus.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "Smart Life",
                        "На данный момент множество людей следит за своим здоровьем и занимается спортом. Этот сайт поможет в достижении своего внешнего идеала красоты, предлагая пользователю широкий ассортимент продуктов  для правильного и спортивного питания премиального качества и по доступной цене.",
                        "Предоставить пользователю сайт с запоминающимися и привлекающими глаз анимациями, которые меняются по мере пролистывания лендинга. Основная информация о предлагаемой продукции должна быть представлена ёмко, предлагая пользователю купить её в конце “путешествия” по странице.",
                        "Первым делом был проведён анализ целевой аудитории компании. Далее сформирована концепция прототипа сайта, которая требовалась для более удобной навигации пользователя. После чего, был создан дизайн-код: общая стилистика, цветовая гамма, анимации. Далее мы прототипировали лендинг. Затем, создание front-end’а на основе прототипа, используя реактивный фреймворк Vue; создание back-end’а, который требовался для подгрузки товаров, отзывов, а также привязки формы обратной связи.",
                        "/img/projects/main13.png",
                        ["/img/projects/skills/vue.png", "/img/projects/skills/javascript.png", "/img/projects/skills/sass.png"],
                        ["/img/projects/main13.png", "/img/projects/sites/smartLife.jpg", "/img/projects/sites/smartLife2.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "VM CAPITAL",
                        "Сайт направлен на позиционирование фирмы, помогающую средним российским компаниям становиться инвестиционно привлекательными, превращаясь в крупный успешный и конкурентоспособный бизнес.\n" +
                        "Выбор VM Capital — сформировать стоимость «изнутри», работая с фундаментальными факторами стоимости, привлекая менеджеров для выстраивания бизнес процессов, отвечающих высоким стандартам ведения современного бизнеса.\n",
                        "Разработать сайт, показывающий и доказывающий экспертность в этой нише. Рассказать о базовых понятиях и довести клиента до покупки.",
                        "Исходя из задач ТЗ, была выбрана концепция сайта. Далее, на основе содержимого технического задания, был разработан дизайн-код и прототип сайта. После чего, на основе прототипа, используя реактивный фреймворк Vue, был создан front-end. Затем, для новостей и формы обратной связи создан back-end.",
                        "/img/projects/main14.png",
                        ["/img/projects/skills/vue.png", "/img/projects/skills/javascript.png", "/img/projects/skills/sass.png"],
                        ["/img/projects/main14.png", "/img/projects/sites/1 (2).png", "/img/projects/sites/2 (2).png", "/img/projects/sites/3 (2).png"],
                        ""
                    ),
                    new Portfolio(
                        "Test Palmeri",
                        "Dunkermotoren GmbH - немецкая производственная компания, которая уже на протяжении долгого времени радует своей продукцией клиентов,а точнее аж с 1950 года  специализируется на высокоточных малогабаритных моторах и редукторах. Данный сайт направлен на увеличение прибыли ,а также клиентской базы и партнеров.",
                        "Разработать сайт, нацеленный на взрослую категорию целевой аудитории. Поэтому, дизайн подразумевает сдержанность и простоту. Использование сайта должно быть комфортным и приятным, даже для не продвинутого пользователя.",
                        "В первую очередь, был проведён анализ целевой аудитории, который требовался для лучшего понимания целей и задач потенциальных клиентов, что дает возможность более тщательно проработать каждый блок сайта. Далее, учитывая все пожелания заказчика, общие практики и желания целевой аудитории, был разработан лаконичный дизайн. После чего, был создан прототип сайта, требующийся для более четкого понимания функционала сайта. Далее, на основе прототипа интерфейса, создан front-end, используя фреймворк Vue. Заключительным этапом стало внедрение front-end’а в back-end c использованием фреймворка Laravel (PHP).",
                        "/img/projects/main10.png",
                        ["/img/projects/skills/vue.png", "/img/projects/skills/javascript.png", "/img/projects/skills/sass.png"],
                        ["/img/projects/main10.png", "/img/projects/sites/TT5.jpg", "/img/projects/sites/TT.jpg",
                            "/img/projects/sites/TT2.jpg", "/img/projects/sites/TT3.jpg", "/img/projects/sites/TT4.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "Happy Partner",
                        "Сайт интернет магазина, который предлагает пользователю готовые оригинальные подарки на праздники. Ассортимент разнообразен и удовлетворит любое желание покупателя. А наборы, собранные с любовью, помогут передать близким всё то, что не смогут донести слова.",
                        "предоставить пользователю сайт, на котором всё внимание будет сконцентрировано на продукции, которая идеально себя продаёт. Минималистичный дизайн, передающий атмосферу домашнего уюта и благополучия.",
                        "Был разработан универсальный дизайн, который подходит для аудитории всех возрастов, но в тоже время, учитывающий желания заказчика: сделать его минималистичным. Использованы «теплые» цвета для придания атмосферы «уюта» на сайте. Далее был создан прототип сайта. На главной странице комплексно представлена вся интересующая пользователя информация. При этом, благодаря грамотному и равномерному распределению информации по странице, она не кажется громоздкой, несмотря на большое количество информации. Затем, на основе прототипа, используя фреймворк Vue, был создан front-end. Отдельный акцент был сделан на безопасности и взломоустойчивости back-end’а, так как мы уважаем пользователей и их персональные данные.",
                        "/img/projects/main15.png",
                        ["/img/projects/skills/vue.png", "/img/projects/skills/javascript.png", "/img/projects/skills/sass.png"],
                        ["/img/projects/main15.png", "/img/projects/sites/HappyPartner.jpg", "/img/projects/sites/HappyPartner2.jpg",
                            "/img/projects/sites/HappyPartner3.jpg", "/img/projects/sites/HappyPartner4.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "Гражданская Инициатива",
                        "Платформа, которая поможет пользователям следить за последними новостями о победителях знаковых конкурсов в России, голосовать за инициативы и поможет лучше узнать культурную жизнь страны.",
                        "Разработать сайт в приятном глазу классическом дизайне. Информация на нем должна быть четко представлена по годам, архив премий должен быть доступен в пару кликов.",
                        "Программистом был проведён анализ технического задания и сделан выбор концепции сайта. Далее, основываясь на ТЗ и желаниях заказчика, был разработан дизайн, согласованный с заказчиком. Затем был создан прототип сайта, который требовался для понимания основного функционала сайта. После чего, был создан front-end на основе прототипа с использованием реактивного фреймворка Vue. И в конечном итоге, создан back-end с базовой системой защиты, учитывая функционал, предоставляемый данным сервисом.",
                        "/img/projects/main16.png",
                        ["/img/projects/skills/vue.png", "/img/projects/skills/javascript.png", "/img/projects/skills/sass.png"],
                        ["/img/projects/main16.png", "/img/projects/sites/3.png", "/img/projects/sites/2.png", "/img/projects/sites/4.png",
                            "/img/projects/sites/5.png", "/img/projects/sites/6.png"],
                        ""
                    ),
                    new Portfolio(
                        "Protectimus",
                        "Сайт специализируется на защите личных данных. Компания используют все ключевые алгоритмы аутентификации личности. Основными направлениями является защита частных данных, обеспечение безопасности.",
                        "Главной задачей стала разработка удобного и простого в использовании сайта, так как простота в использовании является ключевым критерием для потенциальных клиентов этого сегмента целевой аудитории.",
                        "В начале работы был разработан дизайн и концепция верстки сайта на основе тематики будущего web-сайта. После чего, для понимания основного функционала сайта, был создан прототип интерфейса. На основе этого прототипа был разработан front-end, который впоследствии был привязан уже к существующему back-end’у.",
                        "/img/projects/main17.png",
                        ["/img/projects/skills/react.png", "/img/projects/skills/javascript.png", "/img/projects/skills/sass.png"],
                        ["/img/projects/main17.png", "/img/projects/softwareTokens.jpg", "/img/projects/softwareTokens2.jpg",
                            "/img/projects/softwareTokens3.jpg", "/img/projects/softwareTokens4.jpg", "/img/projects/softwareTokens5.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "MoveWice",
                        "Компания MoveWice специализируется на продаже недвижимости. Их команда подбирает агента для клиента, с которым, впоследствии, работают. Данная услуга свидетельствует об ускорении продажи недвижимости, а также повышения стоимости собственности.",
                        "Разработать сайт, показывающий экспертность в сфере недвижимости. Добавить в меню разделы, содержащие информацию о компании. Дизайн минималистичный, ненавязчивый, анимации радуют глаз.",
                        "Прежде всего, был создан уникальный минималистичный дизайн, требуемый заказчиком. Далее, разработан прототип интерфейса сайта. Прототип интерфейса сайта - немаловажный пункт в разработке сайта, т.к. от него зависит основной функционал web-сайта. После чего, шла разработка front-end’а на основе прототипа, используя при этом реактивный фреймворк Vue. Затем, создан back-end, с помощью которого происходит реализация логики сайта. В конце работы, front-end был привязан к back-end’у.",
                        "/img/projects/main11.png",
                        ["/img/projects/skills/vue.png", "/img/projects/skills/javascript.png", "/img/projects/skills/sass.png"],
                        ["/img/projects/main11.png", "/img/projects/sites/moveWise.jpg", "/img/projects/sites/moveWise2.jpg", "/img/projects/sites/moveWise4.jpg",
                            "/img/projects/sites/moveWise5.jpg", "/img/projects/sites/moveWise6.jpg", "/img/projects/sites/moveWise7.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "SplitBill",
                        "Приходилось ли вам сталкиваться с проблемой, когда вы дружной компанией посещаете кафе, а затем пытаетесь разделить  деньги за обед так, чтобы никто не остался обиженным🧾 Уверен, что большинство сталкивалось с данной проблемой. И если раньше, во время использования повсеместно бумажных банкнот,  было просто - то теперь, с появлением информационных устройств - стало немного сложнее.\n",
                        "Создание приложения с геймификацией для удобного разделения счета между людьми в кафе или ресторане с использованием ВТБ API. С помощью сканера QR-кода из чека берется информация о продуктах, чтобы пользователи могли в приложении выбирать, за какую часть счета будут платить(например, за то, что съели сами). ",
                        "Платежи и QR Коды. Для лучшей точности разрабатывалось несколько скриптов. Исполнитель сама рисовала и создавала дизайн. Проблемы с ФНС, так как не успели и собрать все в одно приложение",
                        "/img/projects/main8.png",
                        ["/img/projects/skills/java.png", "/img/projects/skills/firebase.png", "/img/projects/skills/xml.png"],
                        ["/img/projects/main8.png", "/img/projects/diana/main.jpg", "/img/projects/diana/history.jpg",
                            "/img/projects/diana/oplata.jpg", "/img/projects/diana/oplata2.jpg"],
                        ""
                    ),
                    new Portfolio(
                        "ATB",
                        "Смысл приложения облегчить жизнь ученикам в носке тяжёлых рюкзаков на замену электронных книг и т.д заменяя на удобное приложения в использовании",
                        "Разработать приложение для школьников и студентов. Приложение должно помочь школьнликам и студентам забыть про книги в своих рюкзаках",
                        "Данное приложение является сервером для хранения электронных книг. Администрации школ и ВУЗов предоставляется доступ «администратор», чтобы у них была возможность контролировать добавленные в библиотеку учебные издания. В мобильном приложении реализованы такие функции, как: сохранение книги в избранное, что обеспечивает быстрый доступ к ней; рекомендации книг, основанные на личных предпочтениях ученика; скачивание книг, что означает офлайн доступ к книге; возможность рисовать и делать пометки; аналитика.\n",
                        "/img/projects/main18.png",
                        ["/img/projects/skills/java.png", "/img/projects/skills/spring.png", "/img/projects/skills/firebase.png"],
                        ["/img/projects/main18.png", "/img/projects/emil/avtoriz.jpg", "/img/projects/emil/library2.jpg",
                            "/img/projects/emil/profile.jpg", "/img/projects/emil/admin.jpg", "/img/projects/emil/geogr.jpg"],
                        ""
                    )
                ]
            }
        }
    }

</script>

<style scoped lang="scss">
    html {
        overflow-x: hidden;
    }

    header {
        background-color: #1C1D2A;
    }

    p {
        font-family: "Open Sans";
    }

    button.VueCarousel-dot {
        outline: none;
    }

    .portfolio {
        position: absolute;
        width: 100%;
        background-color: $black-darker;
        background-image: url("/img/background/PortfolioBG.svg");
        background-position: center;
        background-repeat: no-repeat;
        background-size: 100%;
    }

    .portfolio-greeting {
        margin-top: 15%;
        background-color: #1C1D2A;
        padding: 0 10% 5% 10%;
    }

    .portfolio-greeting p {
        color: #EBEBF0;
        font-size: 2vh;
        opacity: 0.85;
    }

    .greeting-description {
        display: flex;
        flex-direction: column;
        margin-left: 5%;
        max-width: 50%;
    }

    .greeting-content {
        display: flex;
        flex-direction: row;
    }

    .greeting-img {
        position: relative;
        width: 30%;
    }

    .graphic-editor-list {
        margin-top: auto;
    }

    .graphic-editor {
        max-width: 15%;
        margin-right: 10%;
        margin-top: auto;
    }

    .block {
        margin-top: 10%;
    }

    .block-title {
        margin-left: 10%;
    }

    .block-header {
        color: #EBEBF0;
        font-size: 4vw;
        margin-top: 0;
        font-family: Oswald;
    }

    .block-sub-header {
        color: #FDDD48;
        font-size: 2vw;
        opacity: 0.9;
        width: 20%;
        font-family: "Open Sans";
    }

    .block-sub-header hr {
        color: #FDDD48;
        height: 1px;
        width: 80%;
        margin-left: 10%;
        margin-top: auto;
    }

    .greeting-header {
        font-family: 'Open Sans';
        font-weight: bold;
        color: #ffffff;
        font-size: 48px;
    }

    .block-description {
        color: #EBEBF0;
        max-width: 50%;
        font-size: 2vh;
        margin-left: auto;
        margin-right: auto;
    }

    .block-description p {
        opacity: 0.85;
    }

    .app-img {
        max-width: 50%;
        margin-right: 10%;
    }

    .screenError {
        height: 100vh;
        width: 100vw;
        display: none;
        color: white;
        text-align: center;
        align-items: center;
        font-size: 4vh;
        background: url("/img/background.jpg") 100% 100%;
    }

    video {
        position: relative;
        margin-bottom: 10%;
        width: 60%;
        max-height: 100%;
    }

    #why-description {
        margin-bottom: 10%;
    }

    @media (max-width: 768px) {
        .greeting-content {
            display: flex;
            flex-direction: column;
            align-items: center;
        }
        .greeting-header {
            margin-left: auto;
            margin-right: auto;
        }
        .greeting-img {
            max-width: 100%;
            height: auto;
        }
        .greeting-description {
            margin-left: 0;
        }
    }

    @media (max-width: 730px) {
        .mainPortfolio {
            display: none;
        }
        .screenError {
            display: flex;
        }
    }

    @media (max-height: 460px) {
        .mainPortfolio {
            display: none;
        }
        .screenError {
            display: flex;
        }
    }

</style>
